Olá Gabriel!

Meu nome é Ana Paula Araújo. Fico feliz em rever seu projeto hoje.

Quando vejo um erro pela primeira vez, vou apenas apontá-lo. Vou deixar você encontrá-lo e consertá-lo. Também ao longo do texto farei algumas observações sobre melhorias no código e também farei comentários sobre suas percepções sobre o assunto. Estarei aberta a feedbacks e discussões sobre o tema.

Você encontrará meus comentários abaixo - **por favor, não os mova, modifique ou exclua**.

Você pode encontrar meus comentários em caixas verdes, amarelas ou vermelhas como esta:

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Sucesso. Tudo foi feito corretamente.
</div>

<div class="alert alert-block alert-warning">
<b>Comentário do revisor: </b> <a class="tocSkip"></a>

Observações. Algumas recomendações.
</div>

<div class="alert alert-block alert-danger">

<b>Comentário do revisor: </b> <a class="tocSkip"></a>
    
Precisa de correções. O bloqueio requer algumas correções. O trabalho não pode ser aceito com os comentários em vermelho.
</div>

Você pode me responder usando isso:

<div class="alert alert-block alert-info">
<b>Resposta do Aluno: Realizei as devidas correções.</b> <a class="tocSkip"></a>
</div>

<div class="alert alert-block alert-success">
<b> Comentário geral do revisor</b> <a class="tocSkip"></a>

Gabriel, obrigada por enviar seu projeto. Claramente voce se esforçou bastente e seu projeto esta muito bom! Destaco que você demostrou muito dominio no conteudo e usou métodos que ainda nem foram abordado. Parabens!

A maioria das minhas observações foi em tom de sugestão para ajudá-lo em futuras aplicações, eles não significam que você fez algo errado, mas são coisas que quero destacar que podem ajudá-lo a desenvolver ainda mais suas habilidades. Gostei muito do seu código. Mas ainda existem alguns pontos que devem ser corrigidos antes da sua aprovação!
Destaco os seguintes pontos

<ul style="color:red"> 
      <li> Acrecentar uma descrição do projeto com os objetivos. </li> 
     <li> O arquivo não foi aberto corretamente</li> 
     <li> Sugestao do uso do parametro normalize=True no método value_counts  </li> 
    <li> Justificar algumas decisoes, como o uso do limite de 14364 e sobre o genero 'XNA'  </li> 
    <li> Fazer a categorização para a coluna purpose  </li> 
    <li> Ajustar o calculo de inadimplencias  </li> 

</ul>

Esses pontos destacados são mais elaborados ao decorrer de cada bloco. Cada problema com nosso código é uma chance para aprendermos algo novo.
Boa sorte! :)


    
</div>

<div class="alert alert-block alert-success">
<b> Comentário geral do revisor v.2</b> <a class="tocSkip"></a>

Gabriel obrigada por enviar seu projeto. Fiquei muito feliz com as suas alterações, obrigada pelo tempo dedicado para faze-las. E agora o seu trabalho esta perfeito e você está pronto para a nova sprint! 
    
Eu risquei os meus comentários anteriores nas partes que voce modificou. E meus novos comentário estao marcados da seguinte forma:


<b> Comentário do revisor v.2: </b> 

 Obrigada e Boa sorte ;)

# Análise do risco de inadimplência dos mutuários

Seu projeto é preparar um relatório para a divisão de empréstimos de um banco. Você precisará descobrir se o estado civil de um cliente e o número de filhos têm impacto sobre se ele deixará de pagar um empréstimo. O banco já tem alguns dados sobre a capacidade de crédito dos clientes.

Seu relatório será considerado ao criar uma **pontuação de crédito** de um cliente em potencial. A **contagem de crédito** é usada para avaliar a capacidade de um devedor em potencial de pagar seu empréstimo.

[Neste caderno, você recebe dicas e instruções breves e sugestões de raciocínio. Não os ignore, pois eles são projetados para te equipar com a estrutura do projeto e o ajudarão a analisar o que você está fazendo em um nível mais profundo. Antes de enviar seu projeto, certifique-se de remover todas as dicas e descrições fornecidas a você. Em vez disso, faça com que este relatório pareça que você está enviando para seus colegas de equipe para demonstrar suas descobertas - eles não devem saber que você teve qualquer ajuda externa nossa! Para ajudá-lo, colocamos as dicas que você deve remover entre colchetes.]

[Antes de mergulhar na análise de seus dados, explique os propósitos do projeto e as hipóteses que você testará.]

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Sugiro descrever um pouco mais sobre o projeto e deixar claro qual o objetivo, como tambem a criação de um index. Você também pode deletar esses comentarios de apoio entre colchetes!
    
</div>

## Abra o arquivo de dados e veja as informações gerais.

Comece importando as bibliotecas e carregando os dados. Você pode perceber que precisa de bibliotecas adicionais à medida que avança, o que é totalmente bom - apenas certifique-se de atualizar esta seção quando o fizer.

In [1]:
# Carregando todas as bibliotecas
import pandas as pd

In [2]:
# Carregue os dados
df = pd.read_csv('/datasets/credit_scoring_eng.csv')

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>O arquivo não foi aberto corretamente! É importante ajustar o caminho do arquivo!    
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Otimo. O arquivo foi aberto corretamente!
</div>

## Tarefa 1. Exploração de dados

**Descrição dos dados**
- `children` - o número de crianças na família
- `days_employed` - experiência de trabalho em dias
- `dob_years` - idade do cliente em anos
- `education` - educação do cliente
- `education_id` - identificador de educação
- `family_status` - estado civil do cliente
- `family_status_id` - identificador de estado civil
- `gender` - gênero do cliente
- `income_type` - tipo de emprego
- `debt` - havia alguma dívida no pagamento do empréstimo
- `total_income` - renda mensal
- `purpose` - o objetivo de obter um empréstimo

Agora vamos explorar nossos dados. Você vai querer ver quantas colunas e linhas ele tem, veja algumas linhas para verificar possíveis problemas com os dados.

In [3]:
# Vamos ver quantas linhas e colunas nosso conjunto de dados tem

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
# vamos exibir as primeiras 10 linhas
df.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

A tabela contém 12 colunas.Elas armazenam 3 tipos de dados diferentes: object, int64 e float.

- `children` - int64
- `days_employed` - float64
- `dob_years` - int64
- `education` - object
- `education_id` - int64
- `family_status` - object
- `family_status_id` - int64
- `gender` - object
- `income_type` - object
- `debt` - int64
- `total_income` - float64
- `purpose` - object

Como podemos observar não existe algum erro sobre o estilo da colunas.
A quantidade de valores das colunas é diferente. Isso significa que os dados contém valores ausentes.

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
Sobre o tipo dos dados, a coluna `days_employed` poder ser tranformada para int, para termos esses valores de dias inteiros!
</div>

In [5]:
# Obter informações sobre dados
df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

Há valores ausentes em duas colunas 'days_employed' e 'total_income', que afetam diretamente em nossa pesquisa. Vamos investigar mais anter de substituí-los por marcadores claros

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
As exibições iniciais dos dados foram feitas corretamente. Boas observações! 
</div>

In [6]:
# Vejamos a tabela filtrada com valores ausentes na primeira coluna com dados ausentes

df[df['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

Os valores ausentes parecem simétricos, mas podemos ter a certeza quando compararmos a quantidade de linhas e valores nulos das duas colunas simultaneamente.

In [7]:
# Vamos filtrar dados e observar o número de linhas na tabela filtrada quando os valores são nulos.
df.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

**Conclusão intermediária**


O número de linhas na tabela filtrada corresponde ao número de valores ausentes nas duas colunas, mas não podemos concluir que sejam as mesmas linhas que estejam nulas simultaneamente.


Iremos calcular a porcentagem desses valores faltantes em relação com o nosso conjunto de dados, para verificarmos se podemos preencher e se os dados ausentes podem ser devidos à característica específica do cliente.
contudo precisamos de mais verificações para nosso diagnóstico ser mais preciso.

In [8]:
# Vamos calcular a porcentagem desses valores faltantes em relação com o nosso conjunto de dados

(df.isnull().sum() / df.shape[0]) * 100

children             0.000000
days_employed       10.099884
dob_years            0.000000
education            0.000000
education_id         0.000000
family_status        0.000000
family_status_id     0.000000
gender               0.000000
income_type          0.000000
debt                 0.000000
total_income        10.099884
purpose              0.000000
dtype: float64

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
Bom uso do shape!
</div>

In [9]:
# Verificar a distribuição
df_null = df[df['days_employed'].isnull() & df['total_income'].isnull()]
df_null

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
<s>É importante fazer esse filtro por mais de uma coluna, sugiro usar um filtro com mais de uma condição, usando conectivos logicos como '&'    

</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Obrigada pela correção! 
</div>

Vimos que nas mesma linhas encontra-se o valor ausente para 'days_employed' e 'total_income',

**Possíveis motivos para valores ausentes nos dados**

Já descosbrimos que são simétricos nas duas colunas.

Vamos começar a verificar se os valores ausentes são aleatórios.

In [10]:
# Verificar a distribuição em todo o conjunto de dados
df['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

In [11]:
df_null['income_type'].value_counts(normalize=True)

employee         0.508280
business         0.233671
retiree          0.189972
civil servant    0.067617
entrepreneur     0.000460
Name: income_type, dtype: float64

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
<s>Muito bom! Passando o parametro `normalize=True` no método value_counts, você pode analisar esses valores normalizados, ou seja, dividindo pelo valor total de linhas de df
</div>

**Conclusões**

Podemos concluir que os valores ausentes correspodem as em 10% do nosso arquivo de dados e que estão faltantes em duas colunas 'days_employed' e 'total_income', podemos afirmar que valores são simétricos em relação tanto para as colunas faltantes e para o arquivo em geral.

Isso pode ter sido ocasionado por algum erro na corversão de dados, sendo dessa forma podemos fazer filtragem e preencher os valores ausentes com base nas colunas com dados não ausentes . 

Primeiramente, sobre tudo temos que preparar o arquivo de dados e remover as duplicatas, registros diferentes, artefatos incorretos antes de substituir os valores ausentes.

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
Otimo! É importante explicar as etapas que seram realizadas!
</div>

## Transformação de dados

Vamos examinar cada coluna para ver quais problemas podemos ter nelas.

Vamos verificar os dados na coluna education

In [12]:
# Vamos ver todos os valores na coluna de educação para verificar se e quais grafias precisarão ser corrigidas
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [13]:
# Corrija os registros, se necessário
df['education'] = df['education'].str.lower()

In [14]:
# Verificando todos os valores na coluna para ter certeza de que os corrigimos

df['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Excelente uso de funções, essa padronização ajuda bastante na analise. Mas perceba que esses ajustes poderiam ser feitos usando o.str.lower()  
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Excelente! Dessa forma ficou mais elegante!
</div>

Vamos verificar os dados na coluna `children`

In [15]:
# Vamos ver a distribuição de valores na coluna `children`
df['children'].unique()

array([ 1,  0,  3,  2, -1,  4, 20,  5])

Podemos notar que há valores desproporcionais e valores negativos, eles podem ter ocorrido por um erro de digitação.Vamos corrigi-los.

In [16]:
# [corrija os dados com base na sua decisão]
df['children'] = abs(df['children'])
df['children'] = df['children'].replace(20,2)

In [17]:
# Verificar a coluna `children` novamente para ter certeza de que está tudo corrigido
df['children'].unique()

array([1, 0, 3, 2, 4, 5])

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Concordo com você, parece ser um erro de digitação!  
</div>

Vamos verificar os dados na coluna days_employed.

In [18]:
# Encontre dados problemáticos em `days_employed`, se existirem, e calcule a porcentagem
df['days_employed'].describe()

count     19351.000000
mean      63046.497661
std      140827.311974
min      -18388.949901
25%       -2747.423625
50%       -1203.369529
75%        -291.095954
max      401755.400475
Name: days_employed, dtype: float64

In [19]:
max_days_emp = 14364
max_emp = df[df['days_employed']>max_days_emp].shape[0]
max_emp

3445

14364 é o valor máximo que uma pessoa possa trabalhar, levando em consideraçao que a maior idade é 75, e começou a trabalhar a partir do 18 anos, logo multiplico pelo dias uteis no ano(252) que resulta em 14364.

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>É interessante você justificar esse valor máximo de 14364
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Otimo. 
</div>

In [20]:
df.shape[0]

21525

In [21]:
(max_emp*100)/df.shape[0]

16.004645760743323

Pela analise percebemos que 16% do dados são problematicos, pelo motivo que alguns tem valores de dias trabalhados em negativos e outros excedem o limite maximo de dias trabalhados levando em consideração que o maximo de dias trabalhados 14364 dias e substituimos pela médias para não afetasse tanto na nossa filtragem de dados.

In [22]:
# Aborde os valores problemáticos, se existirem
df['days_employed'] = abs(df['days_employed'])

In [23]:
df_emp_avg = df.dropna().reset_index()
df_emp_avg = df_emp_avg[df_emp_avg['days_employed'] < max_days_emp]['days_employed'].mean()
df_emp_avg

2334.852923616233

In [24]:
df['days_employed'] = df['days_employed'].mask(df['days_employed'] > max_days_emp,df_emp_avg )

In [25]:
# Verifique o resultado - certifique-se de que está corrigido
df['days_employed'].describe()

count    19351.000000
mean      2334.852924
std       2041.385985
min         24.141633
25%        927.009265
50%       2194.220567
75%       2736.948773
max      14240.932400
Name: days_employed, dtype: float64

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Boa abordagem e bom uso do método `mask` 
</div>

Vamos agora olhar para a idade do cliente

In [26]:
# Verifique o `dob_years` para valores suspeitos e conte a porcentagem

df['dob_years'].describe()

count    21525.000000
mean        43.293380
std         12.574584
min          0.000000
25%         33.000000
50%         42.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

In [27]:
(df['dob_years']==0).sum() / len(df)*100

0.4692218350754936

4% das idades são de valores igual a 0, podemos substituir pela médias de idades

In [28]:
# Resolva os problemas na coluna `dob_years`, se existirem
df['dob_years'].sort_values().unique()

array([ 0, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 74, 75])

In [29]:
education_age_mean = df.groupby('education')['dob_years'].mean()
education_age_mean

education
bachelor's degree      40.668061
graduate degree        51.166667
primary education      47.691489
secondary education    44.536992
some college           34.661290
Name: dob_years, dtype: float64

In [30]:
education_age_median = df.groupby('education')['dob_years'].median()
education_age_median

education
bachelor's degree      39.0
graduate degree        51.5
primary education      46.5
secondary education    44.0
some college           31.0
Name: dob_years, dtype: float64

In [31]:

def fill_age(row):
    if row['dob_years']==0:
        return education_age_median[row['education']]
    return row['dob_years']

In [32]:
df['dob_years'] = df.apply(fill_age, axis=1)

In [33]:
# Verifique o resultado - certifique-se de que está corrigido
df['dob_years'].sort_values().unique()

array([19., 20., 21., 22., 23., 24., 25., 26., 27., 28., 29., 30., 31.,
       32., 33., 34., 35., 36., 37., 38., 39., 40., 41., 42., 43., 44.,
       45., 46., 47., 48., 49., 50., 51., 52., 53., 54., 55., 56., 57.,
       58., 59., 60., 61., 62., 63., 64., 65., 66., 67., 68., 69., 70.,
       71., 72., 73., 74., 75.])

Corrigimos com a médiana com valores precisos.

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
    
<s>Sugiro você analisar tanto a média quanto a mediana e escolher de acordo a dispersão dos dados! Outra sugestao é que apos a substituição dos dados você ajuste o tipo, tranformando para int. 
Mas destaco o otimo uso de funções e tabelas dinamicas para resolver o problema.

</div>

<div class="alert alert-block alert-warning">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Muito bom! É interessante discorrer sobre o razão que você escolheu a mediana
</div>

[Agora vamos verificar a coluna `family_status`. Veja que tipo de valores existem e quais problemas você pode precisar resolver.]

In [34]:
# Vamos ver os valores da coluna

df['family_status'].value_counts()

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

In [35]:
df['family_status'].sort_values().unique()

array(['civil partnership', 'divorced', 'married', 'unmarried',
       'widow / widower'], dtype=object)

Ao analizarmos, vimos que esta tudo certo com a coluna 'family_status'

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Você pode comentar que esta tudo ok com a coluna!
</div>

Agora vamos verificar a coluna `gender`. Veja que tipo de valores existem e quais problemas você pode precisar resolver

In [36]:
# Vamos ver os valores na coluna
df['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [37]:
# Verifique o resultado 
df['gender'].sort_values().unique()

array(['F', 'M', 'XNA'], dtype=object)

O genero 'XNA' refere-se ao genero binario, nao havendo a nescessidade de renomear ou excluir. Está tudo certo com essa coluna.

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Existe um valor que não é muito coerente com os dados. Sugiro que você explique o que seria ideal nesse caso, na sua opnião, uma substituição, deletar o dado, ou deixar o dado porque pode se tratar de um genero binario, algo do tipo. Mas é interessante deixar claro no texto!
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Excelente!
</div>

Agora vamos verificar a coluna `income_type`. Veja que tipo de valores existem e quais problemas você pode precisar resolver

In [38]:
# Vamos ver os valores na coluna
df['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

In [39]:
# Verifique o resultado 

df['income_type'].sort_values().unique()

array(['business', 'civil servant', 'employee', 'entrepreneur',
       'paternity / maternity leave', 'retiree', 'student', 'unemployed'],
      dtype=object)

Está tudo certo com a coluna'income_type', agora vamos ver se temos duplicatas em nossos dados.

In [40]:
# Verificar duplicatas
df.duplicated().sum()

71

In [41]:
# Aborde as duplicatas, se existirem
df = df.drop_duplicates().reset_index(drop=True)

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Sugiro que os indexes sejam resetados, usando o parametro `reset_index(drop=True)`
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Perfeito!
</div>

In [42]:
# Última verificação se temos duplicatas
df.duplicated().sum()

0

In [43]:
#Verifique o tamanho do conjunto de dados que você tem agora após suas primeiras manipulações com ele
df.shape[0]

21454

Com colunas sem valores inconsistentes podemos avançar em nossas analises, já que as mudanção não foram tão significativas, sendo assim não mudou muito, apenas os dados ficaram mais concisos e congruentes.

# Trabalhando com valores ausentes

### Restaurar valores ausentes em `total_income`


Primeiramente vamos categorizar as idades para manipulas melhor de forma concisa nosso arquivo de dados.Criando a coluna 'age_group',atribuindo a 1 para jovem adultos abaixo de 30 anos, 2 para pessoas de meia idade abaixo 45, 3 para pessoas que estão a um passo de ser idosos abaixo de 60 anos e 4 para os idosos.
As idades interferem incisivamente na renda total, pois, sendo mais experiente a renda costuma-se a ser maior. sendo assim encontramos um norte para preencher os valores ausentes da renda total na coluna 'total_income'

In [44]:
# Vamos escrever uma função que calcule a categoria de idade

def age_group(row):
    age = row['dob_years']
    if age < 30:
        return 1 # pessoas de idade menor que 30 anos ficam no grupo 1
    if age < 45:
        return 2 # pessoas de idade menor que 45 anos ficam no grupo 2
    if age < 60:
        return 3 # pessoas de idade menor que 60 anos ficam no grupo 3
    else:
        return 4 # E as demais ficam no grupo 4

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Excelente uso de funções para essa categorização. Destaco que é interessante que esse return seja um pouco mais explicativo, fica mais dificil a intepretação desse valores. Sugiro você mudar para algo como 'menor que 30' ou '< 30'... algo do tipo, para deixar os dados mais claros
</div>

<div class="alert alert-block alert-warning">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Os dados foram explicados, isso é otimo! Mas mesmo assim na analise de dados esses valores podem ficar um pouco confusos ao decorre do projeto!
</div>

In [45]:
# Teste se a função funciona
age_group(df.loc[1])

2

In [46]:
# Criar coluna nova com base na função

df['age_group'] = df.apply(age_group, axis=1)

In [47]:
# Verificar como os valores na nova coluna
df.columns

Index(['children', 'days_employed', 'dob_years', 'education', 'education_id',
       'family_status', 'family_status_id', 'gender', 'income_type', 'debt',
       'total_income', 'purpose', 'age_group'],
      dtype='object')

Existem dois fatores principais que implicam na renda total, nos quais são a idade e educação, devemos usar valores médios ou medianos para substituir esses valores ausentes.

Criaremos uma tabela que tenha apenas dados sem valores ausentes. Esses dados serão usados para restaurar os valores ausentes.

In [48]:
# Crie uma tabela sem valores ausentes e exiba algumas de suas linhas para garantir que ela fique boa
df_full = df.dropna().reset_index()
df_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19351 entries, 0 to 19350
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             19351 non-null  int64
 1   children          19351 non-null  int64
 2   days_employed     19351 non-null  float64
 3   dob_years         19351 non-null  float64
 4   education         19351 non-null  object
 5   education_id      19351 non-null  int64
 6   family_status     19351 non-null  object
 7   family_status_id  19351 non-null  int64
 8   gender            19351 non-null  object
 9   income_type       19351 non-null  object
 10  debt              19351 non-null  int64
 11  total_income      19351 non-null  float64
 12  purpose           19351 non-null  object
 13  age_group         19351 non-null  int64
dtypes: float64(3), int64(6), object(5)
memory usage: 2.1+ MB

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Os indexes foram renomados aqui! Otimo. Mas fica melhor fazer naquela etapa onde você deleta as duplicatas
</div>

In [49]:
# Veja os valores médios de renda com base em seus fatores identificados
df_full_renda_mean = df_full.pivot_table(index=['age_group','education'], values='total_income', aggfunc='mean') 
df_full_renda_mean

                               total_income
age_group education
1         bachelor's degree    29395.106109
          primary education    27695.271520
          secondary education  23379.052855
          some college         25292.291928
2         bachelor's degree    34672.764916
          graduate degree      18187.301500
          primary education    21447.958202
          secondary education  25869.956458
          some college         32663.133514
3         bachelor's degree    34272.548676
          graduate degree      37358.557500
          primary education    20688.554743
          secondary education  24733.618963
          some college         29538.753468
4         bachelor's degree    30087.861673
          graduate degree      28334.215000
          primary education    18729.638433
          secondary education  21515.480435
          some college         28565.986654

In [50]:
# Veja os valores medianos de renda com base em seus fatores identificados
df_full_renda_median = df_full.pivot_table(index=['age_group','education'], values='total_income', aggfunc='median') 
df_full_renda_median

                               total_income
age_group education
1         bachelor's degree      25956.1640
          primary education      25488.9160
          secondary education    21114.7620
          some college           22687.1980
2         bachelor's degree      28995.3940
          graduate degree        18187.3015
          primary education      19546.3410
          secondary education    22912.3490
          some college           28470.6140
3         bachelor's degree      29369.6900
          graduate degree        37358.5575
          primary education      18271.2275
          secondary education    21785.4435
          some college           26919.6065
4         bachelor's degree      25249.5160
          graduate degree        28334.2150
          primary education      16415.7850
          secondary education    18835.6000
          some college           27142.5995

Como podemos observar, existem valores que são muito altos, com isso fazem  fazem a média menos precisa do que a mediana,isso pode atrapalhar nossa analise.

In [51]:
#  Escreva uma função que usaremos para preencher os valores ausentes
        
median_by_group = df.groupby(["age_group", "education"])["total_income"].agg("median").reset_index().rename(columns={"total_income": "income_mediana"})
median_by_group

    age_group            education  income_mediana
0           1    bachelor's degree      25956.1640
1           1    primary education      25488.9160
2           1  secondary education      21114.7620
3           1         some college      22687.1980
4           2    bachelor's degree      28995.3940
5           2      graduate degree      18187.3015
6           2    primary education      19546.3410
7           2  secondary education      22912.3490
8           2         some college      28470.6140
9           3    bachelor's degree      29369.6900
10          3      graduate degree      37358.5575
11          3    primary education      18271.2275
12          3  secondary education      21785.4435
13          3         some college      26919.6065
14          4    bachelor's degree      25249.5160
15          4      graduate degree      28334.2150
16          4    primary education      16415.7850
17          4  secondary education      18835.6000
18          4         some college      27142.5995

In [52]:
# Verifique se funciona
df = df.merge(median_by_group, on=["age_group", "education"], how="left")
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,income_mediana
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,2,28995.3940
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,2,22912.3490
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,2,22912.3490
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,2,22912.3490
4,0,2334.852924,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,3,21785.4435

In [53]:
# Aplique em todas as linhas
df.loc[df["total_income"].isna(), "total_income"] = df.loc[df["total_income"].isna(), "income_mediana"]
df.head(20)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,income_mediana
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,2,28995.3940
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,2,22912.3490
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,2,22912.3490
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,2,22912.3490
4,0,2334.852924,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,3,21785.4435
5,0,926.185831,27.0,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,1,25956.1640
6,0,2879.202052,43.0,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,2,28995.3940
7,0,152.779569,50.0,secondary education,1,married,0,M,employee,0,21731.829,education,3,21785.4435
8,2,6929.865299,35.0,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,2,28995.3940
9,0,2188.756445,41.0,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,2,22912.3490
10,2,4171.483647,36.0,bachelor's degree,0,married,0,M,business,0,18230.959,buy real estate,2,28995.3940
11,0,792.701887,40.0,secondary education,1,married,0,F,employee,0,12331.077,buy commercial real estate,2,22912.3490
12,0,NaN,65.0,secondary education,1,civil partnership,1,M,retiree,0,18835.600,to have a wedding,4,18835.6000
13,0,1846.641941,54.0,some college,2,married,0,F,employee,0,20873.317,car purchase,3,26919.6065
14,0,1844.956182,56.0,bachelor's degree,0,civil partnership,1,F,business,1,26420.466,buy residential real estate,3,29369.6900
15,1,972.364419,26.0,secondary education,1,married,0,F,employee,0,18691.345,construction of own property,1,21114.7620
16,0,1719.934226,35.0,secondary education,1,married,0,F,employee,0,46272.433,property,2,22912.3490
17,0,2369.999720,33.0,bachelor's degree,0,civil partnership,1,M,employee,0,14465.694,building a property,2,28995.3940
18,0,2334.852924,53.0,secondary education,1,widow / widower,2,F,retiree,0,9091.804,buying a second-hand car,3,21785.4435
19,0,10038.818549,48.0,secondary education,1,divorced,3,F,employee,0,38852.977,buying my own car,3,21785.4435

In [54]:
# Verifique se temos algum erro
df = df.drop(columns=["income_mediana"])

In [55]:
# Verifique se temos algum erro
df["total_income"].isna().sum()

0

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Interessante sua abordagem usando o merge
</div>

Vamos verificar se o número total de valores na coluna 'total_income' corresponde ao número de valores em outras

In [56]:
# Verificar o número de entradas nas colunas
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21454 non-null  float64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      21454 non-null  float64
 11  purpose           21454 non-null  object
 12  age_group         21454 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 2.3+ MB

###  Restaurar valores em `days_employed`

Os parâmentros que podem ajudar a restaurar os valores ausentes no dias trabalhados são 3: Idade, pois dependendo de quantos tem, existe uma limitação de dias trabalhados.Educação, pois dependendo da educação pode ser trabalhar menos em determinados casos.Tipo do emprego, da mesma forma que a educação.

In [57]:
# Distribuição de `days_employed` medianos com base em seus parâmetros identificados

by_group_median = df.groupby(["age_group","income_type"])["days_employed"].agg("median").reset_index().rename(columns={"days_employed": "days_employed_mediana"})
by_group_median

    age_group                  income_type  days_employed_mediana
0           1                     business             908.139502
1           1                civil servant            1362.645769
2           1                     employee            1008.784193
3           1                 entrepreneur             520.848083
4           1                      retiree            2334.852924
5           1                      student             578.751554
6           2                     business            1588.581162
7           2                civil servant            2772.638532
8           2                     employee            1612.484985
9           2  paternity / maternity leave            3296.759962
10          2                      retiree            2334.852924
11          2                   unemployed            2334.852924
12          3                     business            2044.399299
13          3                civil servant            3504.634243
14          3                     employee            2124.336222
15          3                 entrepreneur                    NaN
16          3                      retiree            2334.852924
17          3                   unemployed            2334.852924
18          4                     business            2334.852924
19          4                civil servant            3318.440092
20          4                     employee            2462.762963
21          4                      retiree            2334.852924

In [58]:
# Distribuição de `days_employed` médios com base em seus parâmetros identificados
by_group_mean = df.groupby(["age_group","income_type"])["days_employed"].agg("mean").reset_index().rename(columns={"days_employed": "days_employed_media"})
by_group_mean

    age_group                  income_type  days_employed_media
0           1                     business          1129.938925
1           1                civil servant          1595.684495
2           1                     employee          1202.858627
3           1                 entrepreneur           520.848083
4           1                      retiree          2334.852924
5           1                      student           578.751554
6           2                     business          1986.234560
7           2                civil servant          3160.271436
8           2                     employee          2189.340880
9           2  paternity / maternity leave          3296.759962
10          2                      retiree          2334.852924
11          2                   unemployed          2334.852924
12          3                     business          2779.193401
13          3                civil servant          4396.813945
14          3                     employee          3035.139284
15          3                 entrepreneur                  NaN
16          3                      retiree          2334.852924
17          3                   unemployed          2334.852924
18          4                     business          3241.346970
19          4                civil servant          4343.083365
20          4                     employee          3524.499047
21          4                      retiree          2334.852924

Usaremos novamente a mediana para obter mais valores precisos

In [59]:
# Vamos escrever uma função que calcule médias ou medianas (dependendo da sua decisão) com base no seu parâmetro identificado
df["days_employed"] = df["days_employed"].fillna(df.groupby(["age_group","income_type"])["days_employed"].transform('median'))

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Excelente uso do método `transform()` 
</div>

In [60]:
# Verifique se a função funciona

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     21453 non-null  float64
 2   dob_years         21454 non-null  float64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      21454 non-null  float64
 11  purpose           21454 non-null  object
 12  age_group         21454 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 2.3+ MB

In [61]:
df3 = df[df["age_group"]==3]
df3 = df3[df3["income_type"]=="entrepreneur"]

In [62]:
df.loc[5931,'days_employed'] = df["days_employed"].median()

In [63]:
# Verifique se a função funcionou

df["days_employed"].isna().sum()

0

Vamos verificar se o número total de valores nesta coluna corresponde ao número de valores em outras.

In [64]:
# Verifique as entradas em todas as colunas - certifique-se de corrigir todos os valores ausentes
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     21454 non-null  float64
 2   dob_years         21454 non-null  float64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      21454 non-null  float64
 11  purpose           21454 non-null  object
 12  age_group         21454 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 2.8+ MB

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

Otimo, não temos mais valores ausentes!
</div>

## Categorização de dados

Vamos categorizar os dados para responder algumas questões mas primeiros vamos separar um DataFrame para pessoas que possuem divida e outro para as pessoas que não possuem divida.

In [65]:
# Exiba os valores dos dados selecionados para categorização
df['purpose'].value_counts(normalize=True)

wedding ceremony                            0.036870
having a wedding                            0.035798
to have a wedding                           0.035658
real estate transactions                    0.031463
buy commercial real estate                  0.030810
housing transactions                        0.030391
buying property for renting out             0.030344
transactions with commercial real estate    0.030297
housing                                     0.030111
purchase of the house                       0.030111
purchase of the house for my family         0.029738
construction of own property                0.029598
property                                    0.029505
transactions with my real estate            0.029225
building a real estate                      0.029085
buy real estate                             0.028946
purchase of my own house                    0.028899
building a property                         0.028852
housing renovation                          0.028293
buy residential real estate                 0.028246
buying my own car                           0.023539
going to university                         0.023119
car                                         0.023026
second-hand car purchase                    0.022653
buying a second-hand car                    0.022280
cars                                        0.022280
to own a car                                0.022280
to buy a car                                0.021954
car purchase                                0.021488
supplementary education                     0.021441
purchase of a car                           0.021208
university education                        0.021068
education                                   0.020835
to get a supplementary education            0.020789
getting an education                        0.020602
profile education                           0.020323
getting higher education                    0.019856
to become educated                          0.019017
Name: purpose, dtype: float64

In [66]:
def categorize_purpose(row):
    if 'car' in row['purpose']:
        return 'car'
    if 'hous' in row['purpose'] or 'prop' in row['purpose'] or 'real est' in row['purpose']:
        return 'real estate'
    if 'educat' in row['purpose'] or 'universi' in row['purpose']:
        return 'education'
    if 'weddin' in row['purpose']:
        return 'wedding'

In [67]:
categorize_purpose(df.loc[1])

'car'

In [68]:
df['purpose_group'] = df.apply(categorize_purpose, axis=1)

In [69]:
df['purpose_group'].value_counts(normalize=True)

real estate    0.503915
car            0.200708
education      0.187051
wedding        0.108325
Name: purpose_group, dtype: float64

Vemos que 50% de intençao de empréstimo esta relacionada a compra/manutenção/quitação de dividas relacionadas a casa.

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Interessante essa analise de como esta o top 5 de pessoas com debito e sem debitos. Entretanto o objetivo da categorização é criar uma coluna que categorize a intenção do emprestimo, se você for analisar a quantidade de valores unicos nessa coluna, vai perceber que temos 38 diferentes, mas nos podemos agrupa-los em temas, pois a maioria se repete. Sugiro que você crie essa coluna que categorize em wedding, education, real_estate ou moradia e carro
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Excelente! A categorização ficou otima!
</div>

Vamos criar uma categoria com base no nível de renda, classificados de 'A' como mais alto e 'E' o mais baixo.

In [70]:
# Criar função para categorização em diferentes grupos numéricos com base em intervalos
def preencher_income_level(row):
  if row['total_income'] < 20000:
    return 'E'
  elif row['total_income'] <30000:
    return 'D'
  elif row['total_income'] <40000:
    return 'C'
  elif row['total_income'] <50000:
    return 'B'
  else:
    return 'A'

In [71]:
# Criar coluna com categorias
df['income_level'] = df.apply(preencher_income_level, axis=1)

In [72]:
# Conte os valores de cada categoria para ver a distribuição
df['income_level'].value_counts()

D    7951
E    7584
C    3107
B    1492
A    1320
Name: income_level, dtype: int64

<div class="alert alert-block alert-success">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>
 
Boa categorização de renda, e analise dos dados
</div>

## Verificar as Hipóteses

**Existe uma correlação entre a quantidade de crianças e do pagamento em dia?**

In [73]:
# Verifique os dados das crianças e do pagamento em dia

pivot_children = df.pivot_table(index='children',columns='debt',values='days_employed', aggfunc='count') 
# Calcular a taxa de inadimplência com base no número de filhos
pivot_children['taxa_de_inadimplencia'] = (pivot_children[1] / (pivot_children[1]+pivot_children[0])*100)

In [74]:
pivot_children.sort_values(by='taxa_de_inadimplencia', ascending=False)

debt            0       1  taxa_de_inadimplencia
children
4            37.0     4.0               9.756098
2          1926.0   202.0               9.492481
1          4410.0   445.0               9.165808
3           303.0    27.0               8.181818
0         13028.0  1063.0               7.543822
5             9.0     NaN                    NaN

Concluimos que a maior taxa inadimplência é de 4 filhos é de quase 10%!!!

<div class="alert alert-block alert-danger">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Nessa etapa é interessante usar o df original para analisarmos se o numero de crianças tem correlaçao com o pagamento em dia. Você esta usando apenas o df filtrado por pessoas com debito, é interessante fazer essa analise tambem baseado nas  pessoas sem debito. Você pode criar um pivot com o index sendo children, columns= 'debt', e depois criar uma coluna indicando essa porcentagem. Sugiro essa modificação para as outras analises (status familiar, income_level...)
</div>

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Ficou muito bom! A taxa de inadimplência relacionada com o numero de filhos foi calculada corretamente
</div>

**Existe uma correlação entre o status familiar e o pagamento em dia?**

In [75]:
# Verifique os dados de status da família e do pagamento em dia

pivot_family_status = df.pivot_table(index='family_status',columns='debt',values='days_employed', aggfunc='count') 
# Calcular a taxa padrão com base no status da família
pivot_family_status['taxa_de_inadimplencia'] = (pivot_family_status[1] / (pivot_family_status[1]+pivot_family_status[0])*100)

In [76]:
pivot_family_status.sort_values(by='taxa_de_inadimplencia', ascending=False)

debt                   0    1  taxa_de_inadimplencia
family_status
unmarried           2536  274               9.750890
civil partnership   3763  388               9.347145
married            11408  931               7.545182
divorced            1110   85               7.112971
widow / widower      896   63               6.569343

**Conclusão**
A maior taxa de inadimplência são de pessoas solteiras quase 10%.

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

A taxa de inadimplência relacionada com status familiar foi calculada corretamente 
</div>

**Existe uma correlação entre o nivel de renda e o pagamento em dia?**

In [77]:
# Verifique os dados do nível de renda e do pagamento em dia

pivot_income_level = df.pivot_table(index='income_level',columns='debt',values='days_employed', aggfunc='count') 
# Calcular a taxa de inadimplência com base no nível de renda
pivot_income_level['taxa_de_inadimplencia'] = (pivot_income_level[1] / (pivot_income_level[1]+pivot_income_level[0])*100)

In [78]:
pivot_income_level.sort_values(by='taxa_de_inadimplencia', ascending=False)

debt             0    1  taxa_de_inadimplencia
income_level
D             7268  683               8.590114
E             6962  622               8.201477
C             2865  242               7.788864
A             1228   92               6.969697
B             1390  102               6.836461

**Conclusão**
Pessoas no nivel de renda D, tem a maior taxa de inadimplência, em torno de 8,5%.

<div class="alert alert-block alert-success">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

A taxa de inadimplência relacionada com renda foi calculada corretamente.
</div>

**Como a finalidade do crédito afeta a taxa de inadimplência?**

In [79]:
# Confira os percentuais de inadimplência para cada finalidade de crédito e analise-os

pivot_purpose_group = df.pivot_table(index='purpose_group',columns='debt',values='days_employed', aggfunc='count') 
pivot_purpose_group['taxa_de_inadimplencia'] = (pivot_purpose_group[1] / (pivot_purpose_group[1]+pivot_purpose_group[0])*100)

In [80]:
pivot_purpose_group.sort_values(by='taxa_de_inadimplencia', ascending=False)

debt               0    1  taxa_de_inadimplencia
purpose_group
car             3903  403               9.359034
education       3643  370               9.220035
wedding         2138  186               8.003442
real estate    10029  782               7.233373

In [81]:
pivot_purpose = df.pivot_table(index='purpose',columns='debt',values='days_employed', aggfunc='count') 
pivot_purpose['taxa_de_inadimplencia'] = (pivot_purpose[1] / (pivot_purpose[1]+pivot_purpose[0])*100)

In [82]:
pivot_purpose.sort_values(by='taxa_de_inadimplencia', ascending=False)

debt                                        0   1  taxa_de_inadimplencia
purpose
to get a supplementary education          395  51              11.434978
purchase of a car                         405  50              10.989011
getting higher education                  380  46              10.798122
second-hand car purchase                  435  51              10.493827
profile education                         392  44              10.091743
to own a car                              430  48              10.041841
to become educated                        369  39               9.558824
to buy a car                              427  44               9.341826
cars                                      434  44               9.205021
car purchase                              419  42               9.110629
buying my own car                         459  46               9.108911
university education                      412  40               8.849558
building a property                       565  54               8.723748
going to university                       453  43               8.669355
car                                       452  42               8.502024
getting an education                      405  37               8.371041
having a wedding                          704  64               8.333333
supplementary education                   422  38               8.260870
real estate transactions                  620  55               8.148148
wedding ceremony                          727  64               8.091024
transactions with commercial real estate  598  52               8.000000
buying property for renting out           599  52               7.987711
transactions with my real estate          577  50               7.974482
building a real estate                    576  48               7.692308
to have a wedding                         707  58               7.581699
buying a second-hand car                  442  36               7.531381
purchase of the house                     598  48               7.430341
housing transactions                      604  48               7.361963
education                                 415  32               7.158837
housing                                   600  46               7.120743
buy commercial real estate                614  47               7.110439
purchase of the house for my family       593  45               7.053292
buy real estate                           578  43               6.924316
buy residential real estate               565  41               6.765677
property                                  591  42               6.635071
construction of own property              593  42               6.614173
housing renovation                        572  35               5.766063
purchase of my own house                  586  34               5.483871

**Conclusão**
Sobre as inteções de empréstimo, usando um grupo de propósitos sobre o empréstimo, empréstimos relacionado para resolver assuntos sobre o carro fica em primeiro lugar com 9,5%, mas se fomos mais especificos por assunto, o propósito 'para obter uma educação complementar' é o campeão de inadimplência com 11,4%.

<div class="alert alert-block alert-warning">
<b> Comentário do revisor v.2: </b> <a class="tocSkip"></a>

Sugiro que seja usado a coluna que foi categorizada!
</div>

# Conclusão Geral 



Neste projeto realizamos o pré-processamento de dados,em cada coluna realizamos a padronização de estilos, modificamos valores incongruentes, substituimos valores ausentes com base em estudos sobre outras colunas com valores devidamente preenchidos, removemos as duplicatas de valores existente na base de dados, fizemos pesquisa de quais fatores são mais determinantes para os usuários inadimplêntes e concluímos que fatores como: a quantidade de filhos, estado civil do cliente , a finalidade de crédito e o nível de renda são valores que impactam significativamente a inadimplência do clientes.

<div class="alert alert-block alert-warning">
<b> Comentário do revisor: </b> <a class="tocSkip"></a>

<s>Sugiro que você descreva um pouco mais sobre o que foi feito. Você fez um excelente trabalho, tenta destacar nessa parte!
</div>